info_patient = [
    (1, 'Русаков Захар Сергеевич', 'Андреев Елисей Юрьевич', 'остеохондроз', 1500),
    (2, 'Ковалёв Влас Тарасович', 'Андреев Елисей Юрьевич', 'сколиоз', 1000),
    (3, 'Гордеев Афанасий Георгиевич', 'Лобанов Семен Витальевич', 'сколиоз', 1000),
    (4, 'Карпов Оскар Оскарович', 'Лобанов Семен Витальевич', 'артрит', 2000),
    (5, 'Пономарёв Евгений Германнович', 'Лобанов Семен Витальевич', 'остеохондроз', 1500),
    (6, 'Терентьев Рубен Яковлевич', 'Брагин Варлам Федорович', 'шляттр', 1800),
    (7, 'Петров Николай Тимурович', 'Андреев Елисей Юрьевич', 'артрит', 2000),
    (8, 'Котова Алиса Тимуровна', 'Брагин Варлам Федоровичч', 'сколиоз', 1000),
    (9, 'Зайцев Игорь Авдеевич', 'Брагин Варлам Федорович', 'сколиоз', 1000),
    (10, 'Щербаков Алексей Давидович', 'Брагин Варлам Федорович', 'шляттр', 1800),
]